[
  {
    "id": "22",
    "name": "George D. Loeb Jr",
    "bio": "George currently writes for a Substack titled <i><a href='https://thecaseofgeorgeloeb.substack.com/'>The Case of George Loeb</a></i>.<br><br><a href='https://thecaseofgeorgeloeb.substack.com/'>Read it here.</a><br><br>George David Loeb Junior was born 3 February 1957 in Teaneck, New Jersey. Raised in North Miami, Florida, George graduated from North Miami High School (class of 1975), and earned an Associate of Arts, with honors from Miami-Dade Community College in 1977.<br><br>Loeb was employed in restaurants, retail management and in the automotive parts and service field. Later, returning to school, Loeb attended the University of Colorado, while living in Boulder from 1981-85. There he met and married Barbara \"Barb\" Krueger, who Loeb describes, to this day, as \"a saintly woman\".<br><br>The Loebs later moved to Jacksonville, Florida where he graduated from the University of North Florida (Bachelor of Business Administration 1985). While in Jacksonville, Loeb made powerful enemies, first as the co-founder of Citizens For A Better Florida, Inc., inventors of a unique and aggressive anti-telemarketing no-call list. Loeb also angered corrupt politicians and big business interests as an open forum speaker and writer of numerous \"letters to the editor\" published primarily by the major daily newspaper, The Florida Times-Union.<br><br>Loeb was also a member and reverend in the highly controversial Otto, North Carolina-based White racial organization, then known as Church Of The Creator. Among his accomplishments there, Loeb arranged for COTC Founder Ben Klassen's only nationally televised TV interview.<br><br><strong>17 May 1991<br>Neptune Beach, Florida</strong><br><br>George Loeb and his wife Barb, were entering a grocery store parking lot when there was a near collision between the car driven by Mr. Loeb and a car driven by troubled black US Navy Sailor, Harold Mansfield. Mansfield \"blew his horn in anger\" and began wildly cursing, calling Loeb a \"cracker\" and a \"redneck\". Mr. Loeb drove on, into the parking lot. Mansfield's car was seen driving away on Atlantic Blvd. It is undisputed Mansfield returned to the scene almost 30 minutes later with a brick and an accomplice, fellow black US Navy Sailor Stephen Rutledge.<br><br>Just as the Loeb's entered their car to leave, Mansfield's car came to a screeching stop alongside. Mansfield got out armed with the brick saying he was going to \"smash [his] motherf***ing head in.\"<br><br>Loeb fired a single shot killing Mansfield. Witnesses said Loeb fired several other shots 'high in the air', forcing Rutledge to retreat. Though an obvious case of road rage on the part of the decedent, Mansfield, the court allowed Loeb's racial view to become the focus at trial. George Loeb was convicted of premeditated murder and sentenced to life with 25 years minimum mandatory. Even though some appeals may still be possible Mr. Loeb, a political prisoner, has been unable to find any competent attorney willing to take his case.<br><br>Barb Loeb filed for, and was granted, a divorce in 1996.<br><br>George Loeb is currently incarcerated at the Columbia Correctional Institution in Lake City, Florida.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/LOEB_GEORGE.PNG",
    "state": "FL",
    "mailing_address": "Loeb, George D JR., DC# 292124\nPO Box 23608\nTampa, FL 33623",
    "facility_url": "http://www.dc.state.fl.us/offenderSearch/detail.aspx?Page=Detail&DCNumber=292124&TypeSearch=AI",
    "wishlists": [
      {
        "name": "null",
        "url": "#",
        "cost": "$null"
      }
    ]
  }
]
