[
  {
    "id": "16",
    "name": "Joshua Michael Steever",
    "bio": "Joshua Steever, founder of the US chapter of the Aryan Strikeforce, is serving a <a href='https://www.pennlive.com/crime/2020/07/founder-of-a-white-nationalist-group-sentenced-to-20-years-in-drugs-guns-case.html'>20-year sentence</a> after becoming the main target of an FBI operation that manufactured a drugs-for-guns conspiracy from start to finish.<br><br><a href='https://www.pennlive.com/crime/2020/07/founder-of-a-white-nationalist-group-sentenced-to-20-years-in-drugs-guns-case.html'><i>PennLive</i></a> reports that federal agents orchestrated all aspects of the alleged \"drugs-for-guns\" plot, using fake methamphetamine and staging sales for gift cards allegedly meant to buy weapons.<br><br>Joshua ultimately <a href='https://www.pennlive.com/crime/2020/07/founder-of-a-white-nationalist-group-sentenced-to-20-years-in-drugs-guns-case.html'>pleaded guilty</a> to conspiracy to distribute controlled substances despite no real meth being involved.<br><br>As <i>National Justice</i> notes, there was no existing conspiracy until FBI undercover employees infiltrated the group, supplied the drugs, posed as buyers, and drove the entire plan. Several defendants, including a cancer-stricken, homeless co-defendant, <a href='https://www.adl.org/resources/article/racist-skinhead-crew-aryan-strikeforce-88-stands-8-arrests-8-months'>Jacob Robards</a>, were drawn into the operation while facing desperate circumstances.<br><br>Joshua is being held at a medium-security Federal Corrections Institution in Otisville, NY. Due to the close proximity to New York City and its friendliness to Orthodox Jewish rituals, it has been referred to as \"Jewish jail.\" In 2008, <a href='https://nymag.com/news/intelligencer/46010/'>Jews</a> were estimated to be around 5%-10% of the prison's population, with no wildly publicized update since.<br><br>FCI Otisville was the home of the infamous Jewish fraudster, <a href='https://www.justice.gov/pardon/page/file/1358301/dl?inline'>Sholam Weiss</a> until 2021. Weiss was serving out a sentence of around 835 years when he received a pardon from President Donald Trump in 2021.<br><br>Joshua has been associated with the pro-white movement for decades. He has been a Skinhead since he was 13 and is a devout Odinist. In his personal life, Joshua enjoys tattoo culture and has worked as a tattoo artist himself.<br><br>For those able to help, Joshua loves to read any books about his religion, his people or the tattoo scene.",
    "profile_link": "#",
    "image_url": "pictures/STEEVER_JOSHUA2.png",
    "state": "NY",
    "mailing_address": "Joshua Michael Steever #75745-067\nFCI Otisville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 1000\nOTISVILLE, NY   10963",
    "wishlists": [
      {
        "name": "Havamal for Heathens - by Woden's Folk Kindred",
        "url": "https://www.amazon.com/Havamal-Heathens-Wodens-Folk-Kindred/dp/1726271439/",
        "cost": "$12.95",
        "code": "JSTEEVER1"
      },
      {
        "name": "The Call of our Ancient Nordic Religion - by Rud Mills",
        "url": "https://www.amazon.com/Call-our-Ancient-Nordic-Religion/dp/1471696286/",
        "cost": "$10",
        "code": "JSTEEVER2"
      },
      {
        "name": "Revolver magazine - 1 year subscription (4 issues)",
        "url": "https://ezsubscription.com/rvl/giveagift",
        "cost": "$49.99",
        "code": "JSTEEVER3"
      }
    ]
  }
]
