[
  {
    "id": "15",
    "name": "Stephen Pattison",
    "bio": "Stephen is currently serving a <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>9-year federal prison sentence</a> after being convicted of possession of a firearm and ammunition by a convicted felon.<br><br>He is scheduled for release on August 23, 2028.<br><br>Stephen is presently located at the United States Penitentiary, Florence High in central Colorado. The prison shares a campus with the notorious ADX Florence, a facility known as the \"Alcatraz of the Rockies.\"<br><br>Despite his somewhat moderate charges, Stephen finds himself among some of America's most notorious convicted terrorists, including several who are linked to Al-Qaeda.<br><br>According to a <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>criminal complaint</a> filed by the anti-White FBI agent, Adam Paradowski, the local Joint Terrorism Task Force became aware of Stephen when he counter-protested Black Lives Matter. At both of the protests in September 2020, Paradowski noted that Pattison was merely near people that were engaged in arguments or confrontations. Some of which included threats.<br><br>According to Paradowski, police happened upon Stephen during an <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>Upstate New York traffic stop</a>, realizing that Stephen had a warrant out for his arrest for absconding parole in Missouri. Stephen tells <i>SE</i> that this leaves out many crucial details, including the fact that the same government that filed this warrant never pursued a conviction. Stephen further explained that he was not absconding parole, he was living openly with his family and had been transferred to the supervision of New York State.<br><br>While the police closed in on Stephen, antifascist criminals were threatening his entire family, including his children.<br><br>During Stephen's <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>sentencing phase</a>, his own attorney referred to his views as \"repugnant to most Americans,\" and called him a \"neo-Nazi.\" The unoriginal Judge Larimer would suggest to Stephen that he use his time in prison to get an education and to read the anti-racist Black poet, Maya Angelou.<br><br>Today, Stephen remains dedicated to his race, which includes several children of his own. He prefers to spend his days at Florence socializing with his white friends or in long debates about race and history with inmates of other backgrounds. When finances allows, he calls family and friends.<br><br>Stephen always welcomes letters from his comrades.",
    "profile_link": "#",
    "image_url": "pictures/PATTISON_STEPHEN6.jpg",
    "state": "CO",
    "mailing_address": "STEPHEN REED PATTISON 19944-509\nUSP FLORENCE - HIGH\nU.S. PENITENTIARY\nP.O. BOX 7000\nFLORENCE, CO 81226",
    "wishlists": [
      {
        "name": "null",
        "url": "#",
        "cost": "$null"
      }
    ]
  }
]
