[
  {
    "id": "15",
    "name": "Stephen Pattison",
    "bio": "Stephen is currently serving a <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>9-year federal prison sentence</a> after being convicted of possession of a firearm and ammunition by a convicted felon.<br><br>He is scheduled for release on August 23, 2028.<br><br>According to a criminal complaint filed by the anti-White FBI agent, Adam Paradowski, the local Joint Terrorism Task Force became aware of Stephen when he counter-protested Black Lives Matter. At both of the protests in September 2020, Paradowski noted that Pattison was merely near people that were engaged in arguments or confrontations. Some of which included threats.<br><br>According to Paradowski, police happened upon Stephen during an <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>Upstate New York traffic stop</a>, realizing that Stephen had a warrant out for his arrest for absconding parole in Missouri. Stephen tells <i>SE</i> that this leaves out many crucial details, including the fact that the same government that filed the warrant, never pursued a conviction. Stephen further explained that he was not absconding parole, he was with his family and had been transferred to the supervision of New York State.<br><br>Additionally, Stephen said that the traffic stop occurred down the road from his home and was the culmination of several days worth of surveillance that included regular drone flyovers. All of this took place while Antifascist criminals were threatening his entire family, including his children.<br><br>If Stephen’s attorney ever raised these issues, <i>The Solidarity Exchange</i> was unable to find any evidence of it.<br><br>During the arrest, police saw that Stephen had decorated his cell phone with a '1488' sticker, which in America, gave the police even more moral authority to place Stephen under maximum state pressure.<br><br>Shortly thereafter, a search warrant was issued for Stephen’s residence where illicit firearms and ammunition were discovered by <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>an incredible assembly of both federal and local law enforcement</a>.<br><br>Unfortunately for Stephen, this selective use of state power against pro-White suspects was only the beginning.<br><br>After a misguided attempt to conceal Stephen’s ownership of the weapons resulted in the <a href='https://www.justice.gov/usao-wdny/pr/rochester-man-going-prison-transferring-shotgun-and-ammunition-convicted-felon'>indictment of his friend and the mother of his children</a>, Stephen admitted to his error in judgment and accepted a plea bargain on a weapons possession charge.<br><br>The maximum penalty would net up to ten years in prison; however, <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>sentencing guidelines</a> suggested a maximum of 4.75 years for a person with Stephen’s record. A key, yet often overlooked clause within many plea agreements would prevent Stephen from withdrawing his plea, even if the judge had decided to increase the suggested punishment.<br><br>Around two months later, the same government that just signed a plea agreement with Stephen recommended to Judge Larimer that he be <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>sentenced to 10 years in prison</a>, with a great emphasis placed on his National Socialist views. Larimer seemingly took heed, issuing to Stephen an 8 year long prison sentence.<br><br>During Stephen’s sentencing phase, his own attorney referred to his views as <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>\"repugnant to most Americans,\" and called him a \"neo-Nazi.\"</a> The unoriginal Larimer would suggest to Stephen that he use his 96 months in prison to get an education and to read the antiracist Black poet, <a href='https://www.britannica.com/biography/Maya-Angelou'>Maya Angelou</a>.<br><br>Since he was 15, Stephen had been associated with pro-White societal outcasts, a lifestyle that few know anything about. Stephen had previously told the court that the original purpose for his associations was for <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>self-defense in an ever diversifying and increasingly dangerous America.</a> While Stephen’s life was certainly not perfect, for the unapologetic White man, the alternative was unthinkable and undoable. It became not only difficult, but even undesirable to rejoin a society that is inherently anti-White.<br><br>When Stephen was out of prison, this wasn’t a direct problem; however, once sentenced to 8 years, survival again became an issue. Shortly after sentencing, Stephen got into a fight with a fellow White inmate, who was allegedly <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>selling weapons to members of another race</a>.<br><br>Unfortunately, the other inmate was gravely injured, but ultimately survived.<br><br>According to prosecutors, Stephen had informed prison staff that Whites were going to make a move, and it was merely <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>his time to put in 'work.'</a><br><br>Stephen insists that is a dangerous lie, as not only did Stephen assert his right under the Fifth Amendment, it also implied that Stephen is a 'snitch.'<br><br>Perhaps because of this, Larimer would rescind his previous sentence, <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>handing out an extra year to Stephen</a>, making 9 in total.<br><br>Stephen’s attorney had presciently warned Larimer that singling out Stephen for a long sentence in the American prison system would do nothing to help his rehabilitation — but it seems that when a White convict is involved, systemic responsibility is conveniently shifted onto the individual.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/PATTISON_STEPHEN2.png",
    "state": "CO",
    "mailing_address": "STEPHEN REED PATTISON 19944-509\nUSP FLORENCE - HIGH\nU.S. PENITENTIARY\nP.O. BOX 7000\nFLORENCE, CO 81226"
  },
  {
    "id": "31",
    "name": "Brandon Clint Russell",
    "bio": "Brandon Russell is currently incarcerated—most recently in Maryland State Prison—after being <a href='https://www.courtlistener.com/docket/66811663/united-states-v-clendaniel/'>convicted of conspiracy</a> to damage an energy facility in an FBI-involved scheme.<br><br>In <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>August of 2025</a>, Brandon was sentenced to the allowed maximum of 20 years in prison. He reportedly plans to appeal.<br><br>The prosecution claimed that Brandon and his co-defendant, reported girlfriend Sarah Clendaniel, would have done a whopping $75 million in damage to various power stations using only <a href='https://archive.ph/1YrDV'>guns and mylar balloons.</a><br><br>Sarah, who pleaded guilty and received an 18-year sentence for her alleged role in the plot, was dying of kidney failure at the time of the sting.<br><br>Brandon would attempt to identify the government's confidential informants but his legal motions were defeated and he was convicted in February of 2025.<br><br>One of the anonymous witnesses would reveal that he had been paid $70,000 by the FBI during his four years as a per diem professional informant. One month after Russell was convicted, the government revealed the same witness had been paid an additional $7,000 that he failed to disclose. This payment was sent the week of jury selection.<br><br>Nevertheless, <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>Judge James K. Bredar</a> did not think this sufficient to hold a new trial. The same judge had once dismissed a potential juror who claimed to be a racist, saying, &quot;you're excused. <a href='https://www.wbaltv.com/article/brandon-russell-trial-jury-plot-destroy-baltimore-power-grid/63574539'>We don't tolerate racist views in the justice system</a>.&quot;<br><br>During Brandon and Sarah’s legal proceedings, FBI Director Wray made a public speech where he said that the FBI used a warrantless <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>Foreign Intelligence Surveillance Act</a> (or FISA) wiretap to disrupt a planned attack on the power grid that same year.<br><br>The defense suggested that Wray was referencing Brandon and Sarah’s case and thus, violated their rights. The prosecution dismissed this as speculative, refusing to confirm or deny the implication.<br><br>Despite the <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>unexpected intervention</a> of the ACLU on Russell’s behalf, the government kept their secrets. In a private session with the prosecution, antiracist Judge Bredar agreed that Russell’s rights were protected and that the government did not use evidence from a FISA wiretap.<br><br>Brandon is a veteran of the <a href='https://www.tribune242.com/news/2018/jan/12/bahamian-neo-nazi-jailed-for-five-years-in/'>Florida National Guard</a> and has an undergraduate degree in Nuclear Physics. He is a dual citizen of both the United States and the Bahamas. During his current stay in a Maryland state prison, Russell began his own newsletter titled simply, <i>White Prison Newsletter</i>.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/RUSSELL_BRANDON.jpg",
    "state": "MD",
    "mailing_address": "Brandon Clint Russell, SID # 5348309\nChesapeake Detention Facility\n401 East Madison Street\nBaltimore, Maryland 21202",
    "facility_url": "https://www.dpscs.state.md.us/inmate/"
  },
  {
    "id": "37",
    "name": "Tyler Tenbrink",
    "bio": "Whistleblower detained for <a href='https://www.google.com'>leaking</a> classified <a href='https://www.google.com'>documents.</a>",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/BLANK.png",
    "state": "SC",
    "mailing_address": "NOT REAL \nFCI Bennettsville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 52020\nBENNETTSVILLE, SC   29512"
  }
]
