[
  {
    "id": "14",
    "name": "Sarah Clendaniel",
    "bio": "Sarah Clendaniel is currently serving 18-years in federal prison after she pled guilty to charges related to an FBI-involved scheme to attack the Baltimore power grid.<br><br>Her scheduled release data is June 5, 2038.<br><br>An FBI collaborator was instrumental to the conspiracy, another common theme to FBI stings. One of several confidential informants offered to deliver both the weapons and Sarah herself to the alleged attack sites.<br><br>Sarah’s case files reveal that she is suffering from kidney failure; an eventually fatal condition. The tactic of targeting the sick or dying for sting operations  has been used in other anti-white stings.<br><br>Like other targets of the FBI’s anti-White stings, Clendaniel was also compromised by a record of prior, apolitical convictions.<br><br>Brandon Russell, Sarah’s husband was also charged and convicted in the conspiracy. Brandon is currently seeking an appeal.<br><br>FCI Tallahassee, where Sarah currently lives, is like many federal correctional institutions and is plagued by a scandalous history. In 2023, an unannounced inspection by the Inspector General revealed numerous serious issues, especially with the infrastructure and food quality. The IG’s report revealed that inmates were often served moldy bread as well as food items that had been ransacked by insects and rodents.<br><br>In 2006, federal authorities attempted to arrest 6 FCI Tallahassee corrections officers in connection to a sex-for-contraband ring ran by guards in the female facility.<br><br>FCI Tallahassee contains a facility for both genders.<br><br>While five officers were arrested without incident, one of the corrections officers, Ralph Hill opened fire with a gun he had smuggled into the facility. One of the arresting agents and a corrections lieutenant were killed in the shootout as well Hill himself.<br><br>For some time, Sarah was in the same facility as the infamous Jewish Zionist sex trafficker, Ghislaine Maxwell until August 2025, when she was moved to a more comfortable, low security prison camp in Texas.<br><br>Sarah is a one-time contributor to White Prison Newsletter, which has released four issues. She always welcomes correspondence from comrades and enjoys receiving commissary as well via Moneygram, Western Union or money order.<br><br>If someone willing to donate is able to find an authentic, softcover copy of writings by Savitri Devi that are sold by a major retailer such as Amazon, please purchase that item and have the retailer send it to Sarah at her address above.<br><br>Alternatively, you can email a link or description of the item directly to The Solidarity Exchange. From there, we will add it to her wishlist section.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/CLENDANIEL_SARAH.PNG",
    "state": "FL",
    "mailing_address": "SARAH BETH CLENDANIEL, #42941-510\nFCI Tallahassee\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 5000\nTALLAHASSEE, FL   32314",
    "wishlists": [
      {
        "name": "Defiance: The Prison Memoirs of Savitri Devi",
        "url": "https://www.barnesandnoble.com/w/defiance-savitri-devi/1117377079",
        "cost": "$30.00",
        "code": "SCLENDANIEL1"
      },
      {
        "name": "A Warning to the Hindus - by Savitri Devi",
        "url": "https://www.amazon.com/Warning-Hindus-Savitri-Devi/dp/8185002401",
        "cost": "$27.25",
        "code": "SCLENDANIEL2"
      }
    ]
  }
]
