[
  {
    "id": "10",
    "name": "Aimenn Penny",
    "bio": "Aimenn is currently serving an <a href='https://www.justice.gov/archives/opa/pr/ohio-man-sentenced-18-years-prison-firebombing-church-planned-host-drag-show-events'>18-year federal prison sentence</a> after being convicted of violating the Church Arson Prevention Act and weapons crimes charges. At the time of <a href='https://www.justice.gov/archives/opa/pr/man-charged-arson-and-possession-destructive-device'>his arrest</a>, he was only 20-years-old.<br><br>The Community Church of Chesterland, OH and its former pastor, Reverend Jess Peacock (seen below) were planning to host a drag show for children. Aimenn reportedly threw molotov cocktails at the church, causing what appears to be localized surface damage. The attack took place outside of business hours, between 12 and 2 am on March 25, 2023. The damage was described by <a href='https://storage.courtlistener.com/recap/gov.uscourts.ohnd.296869/gov.uscourts.ohnd.296869.1.1.pdf'>an FBI agent </a> as \"scorch marks\" and damage to a sign.<br><br><img src='bio_content/reverend_peacock.png'><br><br>Aimenn is scheduled for release on August 28, 2038.<br><br>In April of 2024, the church, Peacock and several other churchgoers filed a <a href='https://www.adl.org/resources/press-release/community-church-chesterland-files-federal-lawsuit-against-members-ohio'>federal civil rights lawsuit</a> against Penny. The suit also included named and unnamed members of a White Lives Matter chapter as defendants. Within the suit, the plaintiffs claim numerous damages including repair costs, lost revenue from a client that rented out a daycare center, muscle spasms and loss of breath while attending church.<br><br>Through great fortune, the plaintiffs have attracted the litigation skills of the anti-White Zionist Jew, <a href='https://www.youtube.com/watch?v=wMHw0LMCr5Y'>James Pasch</a>. Pasch currently serves as the Vice-President of Litigation at the Anti-Defamation League (or ADL). Remarkably, the ADL seems to see no conflict in criticizing white racialism in the courtroom, while it's leader laments \"<a href='https://www.informationliberation.com/?id=65007'>that intermarriage rates [among Jews] continue to go up. Assimilation continues apace.</a>\"<br><br>Aimenn is currently held at Federal Corrections Institution McDowell in McDowell County, WV on the border of Northern Virginia. The dual-facility sits atop a <a href='https://archive.ph/20130629094212/http://www.wvpubcast.org/newsarticle.aspx?id=15583'>decapitated mountain</a> that was long ago exploited for its coal.<br><br>The area's 18,400 plus population is estimated to be around 87% White with a median income 25% lower than the national average. The average resident is around 13% older than the average American.<br><br>The presence of these troubling statistics continue to fly in the face of what was the <a href='https://web.archive.org/web/20160409201618/https://www.highbeam.com/doc/1P2-13854697.html'>original understanding</a> with McDowell's residents in 2004: the feds build a prison, and you get a decent job.<br><br>5 years after the first construction, the prison began accepting job applications. Some time after it's opening in 2010, reports from local news showed that <a href='https://archive.ph/20130629094212/http://www.wvpubcast.org/newsarticle.aspx?id=15583'>less than 14%</a> of the facility's first hiring batch were from McDowell County.<br><br>The fact that the local news organizations tracking this story have since shut down further suggests that FCI McDowell did little to rescue a formerly prosperous county, once known as America's leading coal producer.<br><br>Aimenn is a Wotanist, which is a follower of Germanic Paganism. After his recent move to FCI McDowell, Aimenn told the <i>Solidarity Exchange</i> that white inmates enjoy a more united, and therefore safer environment than they did at his previous location. His daily activities include working out, watching the news, and reading before bed. While Aimenn enjoys regularly rereading <i>Mein Kampf</i>, he would certainly appreciate help in acquiring more books from his wishlist.<br><br>On most days, Aimenn checks his regular postage and his <a href='https://www.corrlinks.com/en-US/login'>Corrlinks email</a> where he can be contacted directly. For the security minded pen pal, you can reach out to Aimenn via our <a href='emailproxy.html'>free proxy service</a>.<br><br>Back home, Aimenn owns two wolf-dogs named Skye and Reign.<br><br>You can read a Substack post that Aimenn wrote about his life <a href='https://jiblog.substack.com/p/a-little-about-myself'>here</a> .",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/PENNY_AIMENN.PNG",
    "state": "WV",
    "mailing_address": "AIMENN PENNY, 51942-510<br>FCI McDowell<br>FEDERAL CORRECTIONAL INSTITUTION<br>P.O. BOX 1009<br>WELCH, WV 24801"
  }
]
