[
  {
    "id": "31",
    "name": "Brandon Clint Russell",
    "bio": "Brandon Russell is currently incarcerated—most recently in Maryland State Prison—after being <a href='https://www.courtlistener.com/docket/66811663/united-states-v-clendaniel/'>convicted of conspiracy</a> to damage an energy facility in an FBI-involved scheme.<br><br>In <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>August of 2025</a>, Brandon was sentenced to the allowed maximum of 20 years in prison. He reportedly plans to appeal.<br><br>The prosecution claimed that Brandon and his co-defendant, reported girlfriend Sarah Clendaniel, would have done a whopping $75 million in damage to various power stations using only <a href='https://archive.ph/1YrDV'>guns and mylar balloons.</a><br><br>Sarah, who pleaded guilty and received an 18-year sentence for her alleged role in the plot, was dying of kidney failure at the time of the sting.<br><br>Brandon would attempt to identify the government's confidential informants but his legal motions were defeated and he was convicted in February of 2025.<br><br>One of the anonymous witnesses would reveal that he had been paid $70,000 by the FBI during his four years as a per diem professional informant. One month after Russell was convicted, the government revealed the same witness had been paid an additional $7,000 that he failed to disclose. This payment was sent the week of jury selection.<br><br>Nevertheless, <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>Judge James K. Bredar</a> did not think this sufficient to hold a new trial. The same judge had once dismissed a potential juror who claimed to be a racist, saying, &quot;you're excused. <a href='https://www.wbaltv.com/article/brandon-russell-trial-jury-plot-destroy-baltimore-power-grid/63574539'>We don't tolerate racist views in the justice system</a>.&quot;<br><br>During Brandon and Sarah’s legal proceedings, FBI Director Wray made a public speech where he said that the FBI used a warrantless <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>Foreign Intelligence Surveillance Act</a> (or FISA) wiretap to disrupt a planned attack on the power grid that same year.<br><br>The defense suggested that Wray was referencing Brandon and Sarah’s case and thus, violated their rights. The prosecution dismissed this as speculative, refusing to confirm or deny the implication.<br><br>Despite the <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>unexpected intervention</a> of the ACLU on Russell’s behalf, the government kept their secrets. In a private session with the prosecution, antiracist Judge Bredar agreed that Russell’s rights were protected and that the government did not use evidence from a FISA wiretap.<br><br>Brandon is a veteran of the <a href='https://www.tribune242.com/news/2018/jan/12/bahamian-neo-nazi-jailed-for-five-years-in/'>Florida National Guard</a> and has an undergraduate degree in Nuclear Physics. He is a dual citizen of both the United States and the Bahamas. During his current stay in a Maryland state prison, Russell began his own newsletter titled simply, <i>White Prison Newsletter</i>.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/RUSSELL_BRANDON.jpg",
    "state": "MD",
    "mailing_address": "Brandon Clint Russell, SID # 5348309\nChesapeake Detention Facility\n401 East Madison Street\nBaltimore, Maryland 21202",
    "facility_url": "https://www.dpscs.state.md.us/inmate/"
  },
  {
    "id": "27",
    "name": "Luke Austin Lane",
    "bio": "Luke is currently serving a <a href='https://www.south935.com/2021/11/19/two-more-plead-guilty-in-white-supremacist-murder-plot/'>13-year sentence</a> stemming from an FBI-manufactured plot targeting members of The Base’s Georgia cell. While incarcerated, Luke was charged with possession of contraband by a prisoner and charges related to defacing the walls of his cell for which Luke was given a four-year sentence.<br><br>According to <a href='https://archive.ph/S3bg1'><i>National Justice</i></a>, an undercover FBI agent persistently pushed Lane and others toward a planned act of violence, despite early reluctance and repeated delays by the group.<br><br>One of the now convicted members is Brian Mark Lemley. Lemley once confessed to having <a href='https://s3.documentcloud.org/documents/21095526/patrik-jordan-mathews-and-brian-mark-lemley-jr-sentencing-memorandum.pdf'>Jewish heritage</a>, which is cited in court documents. According to CBC’s <a href='https://www.youtube.com/watch?v=h655vCaRTGY'><i>The Fifth Estate</i></a>, the group had also been infiltrated by a journalist with the <i>Winnipeg Free Press</i> and a member of Antifa.<br><br>Luke’s case reflects broader concerns about government entrapment tactics and the way the prison system can force vulnerable Whites further into a criminal underworld.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/LANE_LUKE.jpg",
    "state": "GA",
    "mailing_address": "Not Real #1003053360\nHays State Prison\n777 Underwood Drive\nTrion, GA 30753",
    "facility_url": "https://services.gdc.ga.gov/GDC/OffenderQuery/jsp/OffQryForm.jsp?Institution="
  },
  {
    "id": "10",
    "name": "Aimenn Penny",
    "bio": "Jailed for exposing corruption.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/PENNY_AIMENN.PNG",
    "state": "WV",
    "mailing_address": "AIMENN PENNY, 51942-510\nFCI Hazelton\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 5000\nBRUCETON MILLS, WV   26525"
  }
]
