[
  {
    "id": "15",
    "name": "Stephen Pattison",
    "bio": "Stephen is currently serving a <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>9-year federal prison sentence</a> after being convicted of possession of a firearm and ammunition by a convicted felon.<br><br>He is scheduled for release on August 23, 2028.<br><br>According to a criminal complaint filed by the anti-White FBI agent, Adam Paradowski, the local Joint Terrorism Task Force became aware of Stephen when he counter-protested Black Lives Matter. At both of the protests in September 2020, Paradowski noted that Pattison was merely near people that were engaged in arguments or confrontations. Some of which included threats.<br><br>According to Paradowski, police happened upon Stephen during an <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>Upstate New York traffic stop</a>, realizing that Stephen had a warrant out for his arrest for absconding parole in Missouri. Stephen tells <i>SE</i> that this leaves out many crucial details, including the fact that the same government that filed the warrant, never pursued a conviction. Stephen further explained that he was not absconding parole, he was with his family and had been transferred to the supervision of New York State.<br><br>Additionally, Stephen said that the traffic stop occurred down the road from his home and was the culmination of several days worth of surveillance that included regular drone flyovers. All of this took place while Antifascist criminals were threatening his entire family, including his children.<br><br>If Stephen’s attorney ever raised these issues, <i>The Solidarity Exchange</i> was unable to find any evidence of it.<br><br>During the arrest, police saw that Stephen had decorated his cell phone with a '1488' sticker, which in America, gave the police even more moral authority to place Stephen under maximum state pressure.<br><br>Shortly thereafter, a search warrant was issued for Stephen’s residence where illicit firearms and ammunition were discovered by <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>an incredible assembly of both federal and local law enforcement</a>.<br><br>Unfortunately for Stephen, this selective use of state power against pro-White suspects was only the beginning.<br><br>After a misguided attempt to conceal Stephen’s ownership of the weapons resulted in the <a href='https://www.justice.gov/usao-wdny/pr/rochester-man-going-prison-transferring-shotgun-and-ammunition-convicted-felon'>indictment of his friend and the mother of his children</a>, Stephen admitted to his error in judgment and accepted a plea bargain on a weapons possession charge.<br><br>The maximum penalty would net up to ten years in prison; however, <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>sentencing guidelines</a> suggested a maximum of 4.75 years for a person with Stephen’s record. A key, yet often overlooked clause within many plea agreements would prevent Stephen from withdrawing his plea, even if the judge had decided to increase the suggested punishment.<br><br>Around two months later, the same government that just signed a plea agreement with Stephen recommended to Judge Larimer that he be <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>sentenced to 10 years in prison</a>, with a great emphasis placed on his National Socialist views. Larimer seemingly took heed, issuing to Stephen an 8 year long prison sentence.<br><br>During Stephen’s sentencing phase, his own attorney referred to his views as <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>\"repugnant to most Americans,\" and called him a \"neo-Nazi.\"</a> The unoriginal Larimer would suggest to Stephen that he use his 96 months in prison to get an education and to read the antiracist Black poet, <a href='https://www.britannica.com/biography/Maya-Angelou'>Maya Angelou</a>.<br><br>Since he was 15, Stephen had been associated with pro-White societal outcasts, a lifestyle that few know anything about. Stephen had previously told the court that the original purpose for his associations was for <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>self-defense in an ever diversifying and increasingly dangerous America.</a> While Stephen’s life was certainly not perfect, for the unapologetic White man, the alternative was unthinkable and undoable. It became not only difficult, but even undesirable to rejoin a society that is inherently anti-White.<br><br>When Stephen was out of prison, this wasn’t a direct problem; however, once sentenced to 8 years, survival again became an issue. Shortly after sentencing, Stephen got into a fight with a fellow White inmate, who was allegedly <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>selling weapons to members of another race</a>.<br><br>Unfortunately, the other inmate was gravely injured, but ultimately survived.<br><br>According to prosecutors, Stephen had informed prison staff that Whites were going to make a move, and it was merely <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>his time to put in 'work.'</a><br><br>Stephen insists that is a dangerous lie, as not only did Stephen assert his right under the Fifth Amendment, it also implied that Stephen is a 'snitch.'<br><br>Perhaps because of this, Larimer would rescind his previous sentence, <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>handing out an extra year to Stephen</a>, making 9 in total.<br><br>Stephen’s attorney had presciently warned Larimer that singling out Stephen for a long sentence in the American prison system would do nothing to help his rehabilitation — but it seems that when a White convict is involved, systemic responsibility is conveniently shifted onto the individual.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/PATTISON_STEPHEN.PNG",
    "state": "CO",
    "mailing_address": "STEPHEN REED PATTISON 19944-509\nUSP FLORENCE - HIGH\nU.S. PENITENTIARY\nP.O. BOX 7000\nFLORENCE, CO 81226"
  },
  {
    "id": "02",
    "name": "Michael John Helterbrand",
    "bio": "Michael is currently serving a <A HREF='https://www.south935.com/2021/11/19/two-more-plead-guilty-in-white-supremacist-murder-plot/'>40-year sentence</a> stemming from an FBI-manufactured plot targeting members of The Base’s Georgia cell.<br><br>According to <a href='https://archive.ph/S3bg1'><i>National Justice</i></a>, an undercover FBI agent persistently pushed Michael and others toward a planned act of violence, despite early reluctance and repeated delays by the group.<br><br>One of the now convicted members is Brian Mark Lemley. Lemley once confessed to having <a href='https://s3.documentcloud.org/documents/21095526/patrik-jordan-mathews-and-brian-mark-lemley-jr-sentencing-memorandum.pdf'>Jewish heritage</a>, which is cited in court documents. According to CBC’s <a href='https://www.youtube.com/watch?v=h655vCaRTGY'><i>The Fifth Estate</i></a>, the group had also been infiltrated by a journalist with the <i>Winnipeg Free Press</i> and a member of Antifa.<br><br>Just a few months into his decades-long detention, Michael began to rack up <a href='https://services.gdc.ga.gov/GDC/OffenderQuery/jsp/OffQryForm.jsp'>additional time</a> for his association with prison ‘gangs.’ Floyd County Jail, where Helterbrand was originally detained at, is within <a href='https://www.census.gov/quickfacts/fact/table/'>White-minority</a> county and city.<br><br>Michael’s case reflects broader concerns about government entrapment tactics and the way the prison system can force vulnerable Whites further into a criminal underworld.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/HELTERBRAND_MICHAEL.jpg",
    "state": "TX",
    "mailing_address": "NOT REAL #47849-509\nFCI Big Spring\nFEDERAL CORRECTIONAL INSTITUTION\n1900 SIMLER AVE\nBIG SPRING, TX   79720"
  },
  {
    "id": "16",
    "name": "Joshua Michael Steever",
    "bio": "Joshua, founder of the Aryan Strikeforce, is serving a <a href='https://archive.ph/FSsvL'>20-year sentence</a> after becoming the main target of an FBI operation that manufactured a drugs for guns conspiracy from start to finish.<br><br><a href='https://archive.ph/jm68u'><i>PennLive</i></a> reports that federal agents orchestrated all aspects of the alleged \"drugs-for-guns\" plot, using fake methamphetamine and staging sales for gift cards allegedly meant to buy weapons.<br><br>Steever ultimately pleaded guilty to conspiracy to distribute controlled substances despite no real meth being involved.<br><br>As <a href='https://archive.ph/eerFN'><i>National Justice</i></a> notes, there was no existing conspiracy until FBI undercover employees infiltrated the group, supplied the drugs, posed as buyers, and drove the entire plan. Several defendants, including a cancer-stricken, homeless co-defendant, <a href='https://solidarityexchange.github.io/SE/dynamicbio.html?id=05'>Jacob Mark Robards</a>, were drawn into the operation while facing desperate circumstances.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/STEEVER_JOSHUA.PNG",
    "state": "NY",
    "mailing_address": "Joshua Michael Steever\n#75745-067\nFCI Otisville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 1000\nOTISVILLE, NY   10963"
  }
]
