[
  {
    "id": "04",
    "name": "Patrik Jordan Mathews",
    "bio": "Patrik is a Canadian who crossed the U.S. border without papers and was swiftly branded a domestic terrorist after an FBI entrapment scheme left him and several other members of <a href='https://www.cbsnews.com/minnesota/news/neo-nazi-group-member-patrik-mathews-sentenced-to-9-years-in-prison/'>The Base</a> with a nine-year federal prison sentence.<br><br>According to CBS News, U.S. District Judge Theodore Chuang applied a \"terrorism enhancement\" to Mathews' sentence, stating that recorded conversations between Mathews and Lemley captured the <a href='https://www.cbsnews.com/minnesota/news/neo-nazi-group-member-patrik-mathews-sentenced-to-9-years-in-prison/'>\"virulence\" and \"passion\"</a> in their willingness to kill people and bring down the U.S. government.<br><br>But <a href='https://archive.ph/S3bg1'><i>National Justice</i></a> notes that \"after a long fishing expedition, the federal government was reduced to charging them with a multitude of immigration related crimes… and a number of gun technicalities,\" and that the case relied heavily on surveillance and speculation rather than actual violence.<br><br>One of the now convicted members who transported Matthews was Brian Mark Lemley. Lemley once confessed to having <a href='https://s3.documentcloud.org/documents/21095526/patrik-jordan-mathews-and-brian-mark-lemley-jr-sentencing-memorandum.pdf'>Jewish heritage</a>, which is cited in court documents. According to CBC’s <a href='https://www.youtube.com/watch?v=h655vCaRTGY'><i>The Fifth Estate</i></a>, the group had also been infiltrated by a journalist with the <i>Winnipeg Free Press</i> and a member of Antifa.<br><br>",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/MATHEWS_PATRIK.PNG",
    "state": "SC",
    "mailing_address": "PATRIK JORDAN MATHEWS: 65229-037\nFCI Bennettsville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 52020\nBENNETTSVILLE, SC   29512"
  },
  {
    "id": "03",
    "name": "Nobody",
    "bio": "Whistleblower detained for <a href='https://www.google.com'>leaking</a> classified <a href='https://www.google.com'>documents.</a>",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/BLANK.png",
    "state": "SC",
    "mailing_address": "NOT REAL \nFCI Bennettsville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 52020\nBENNETTSVILLE, SC   29512"
  },
  {
    "id": "14",
    "name": "Sarah Clendaniel",
    "bio": "Sarah Clendaniel is currently serving 18-years in federal prison after she pled guilty to charges related to an FBI-involved scheme to attack the Baltimore power grid.<br><br>The prosecution claimed that Sarah and her co-defendant, Brandon Russell, would have done a whopping $75 million in damage to various power stations using only <a href='https://archive.ph/1YrDV'>guns and mylar balloons.</a><br><br>Her scheduled release data is June 5, 2038.<br><br>Clendaniel’s <a href='https://storage.courtlistener.com/recap/gov.uscourts.mdd.530115/gov.uscourts.mdd.530115.93.0_3.pdf'>plea agreement</a> contains quotes indicating her mental state was compromised and that she was behaving recklessly:<br><br>\"Clendaniel asked [Confidential Human Source 1] to purchase a rifle for her, stating that she wanted to ‘accomplish something worthwhile’ before her death.\"<br><br>The document also reiterates Clendaniel’s kidney failure; an eventually fatal condition. This tactic of targeting the sick or dying was also used in the <a href='https://solidarityexchange.github.io/SE/dynamicbio.html?id=05'>Jacob Robards</a> case.<br><br>Like other targets of the FBI’s anti-White stings, Clendaniel was also compromised by past drug use and a record of prior convictions.<br><br>An FBI collaborator was instrumental to the conspiracy, another common theme to FBI stings. One of several confidential informants was to deliver both the weapons and Sarah herself to the alleged attack sites. As Sarah had only recently regained her license, she said that she did not feel comfortable operating a motor vehicle.<br><br>Accused alongside Sarah was <a href='https://solidarityexchange.github.io/SE/dynamicbio.html?id=31'>Brandon Russell</a>, Clendaniel’s <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>reported boyfriend</a>. He pleaded not guilty to all charges but was eventually convicted and was sentenced in August of 2025 to <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>20 years in prison</a>. Brandon is expected to appeal.<br><br>One month after Russell’s conviction, a confidential informant for the prosecution revealed he had been paid <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>$7,000 the week of jury selection</a> for Brandon. The same witness received $70,000 in total for similar ‘services’ rendered to the FBI but had allegedly failed to disclose the most recent payment.<br><br>Nevertheless, <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>Judge James K. Bredar</a> did not think this sufficient to hold a new trial. The same judge had once dismissed a potential juror who claimed to be a racist, saying, \"you're excused. <a href='https://www.wbaltv.com/article/brandon-russell-trial-jury-plot-destroy-baltimore-power-grid/63574539'>We don't tolerate racist views in the justice system.\"</a><br><br>During Brandon and Sarah’s legal proceedings, FBI Director Wray made a speech where he said that the FBI used a  warrantless <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>Foreign Intelligence Surveillance Act</a> (or FISA) wiretap to disrupt a planned attack on a power grid that same year.<br><br>The defense suggested that Wray was referencing Brandon and Sarah’s case and thus, the FBI had violated their rights. The prosecution dismissed this as speculative.<br><br>Despite the <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>unexpected intervention</a> of the ACLU on Russell’s behalf, the government kept their secrets. In a private session with the prosecution, antiracist Judge Bredar agreed that both Russell’s and Clendaniel’s rights were protected, claiming that the government did not use evidence from a FISA wiretap.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/CLENDANIEL_SARAH.PNG",
    "state": "FL",
    "mailing_address": "SARAH BETH CLENDANIEL, #42941-510\nFCI Tallahassee\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 5000\nTALLAHASSEE, FL   32314"
  }
]
