/* {
  "id": "03",
  "name": "Nobody",
  "bio": "Whistleblower detained for <a href='https://www.google.com'>leaking</a> classified <a href='https://www.google.com'>documents.</a>",
  "profile_link": "#",
  "image_url": "https://solidarityexchange.github.io/SE/pictures/BLANK.png",
  "state": "SC",
  "mailing_address": "NOT REAL \nFCI Bennettsville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 52020\nBENNETTSVILLE, SC   29512",
  "wishlists": [
    {
      "retailer": "Amazon",
      "url": "https://www.amazon.com/dp/example1",
      "name": "Paperback Books Collection",
      "cost": "$25.00"
    }, */
[
     {
      "retailer": "Barnes & Noble",
      "url": "https://www.barnesandnoble.com/w/example2",
      "name": "Writing Journal Set",
      "cost": "$18.50"
    },
    {
      "retailer": "Walmart",
      "url": "https://www.walmart.com/ip/example3",
      "name": "Headphones",
      "cost": "$35.75"
    }
  ]
},
  {
  "id": "10",
  "name": "Aimenn Penny",
  "bio": "Aimenn is currently serving an <a href='https://www.justice.gov/archives/opa/pr/ohio-man-sentenced-18-years-prison-firebombing-church-planned-host-drag-show-events'>18-year federal prison sentence</a> after being convicted of violating the Church Arson Prevention Act and weapons crimes charges. At the time of <a href='https://www.justice.gov/archives/opa/pr/man-charged-arson-and-possession-destructive-device'>his arrest</a>, he was only 20-years-old.<br><br>The Community Church of Chesterland, OH and its former pastor, Reverend Jess Peacock (seen below) were planning to host a drag show for children. Aimenn reportedly threw molotov cocktails at the church, causing what appears to be localized surface damage. The attack took place outside of business hours, between 12 and 2 am on March 25, 2023. The damage was described by <a href='https://storage.courtlistener.com/recap/gov.uscourts.ohnd.296869/gov.uscourts.ohnd.296869.1.1.pdf'>an FBI agent </a> as \"scorch marks\" and damage to a sign.<br><br><img src='bio_content/reverend_peacock.png'><br><br>Aimenn is scheduled for release on August 28, 2038.<br><br>In April of 2024, the church, Peacock and several other churchgoers filed a <a href='https://www.adl.org/resources/press-release/community-church-chesterland-files-federal-lawsuit-against-members-ohio'>federal civil rights lawsuit</a> against Penny. The suit also included named and unnamed members of a White Lives Matter chapter as defendants. Within the suit, the plaintiffs claim numerous damages including repair costs, lost revenue from a client that rented out a daycare center, muscle spasms and loss of breath while attending church.<br><br>Through great fortune, the plaintiffs have attracted the litigation skills of the anti-White Zionist Jew, <a href='https://www.youtube.com/watch?v=wMHw0LMCr5Y'>James Pasch</a>. Pasch currently serves as the Vice-President of Litigation at the Anti-Defamation League (or ADL). Remarkably, the ADL seems to see no conflict in criticizing white racialism in the courtroom, while it's leader laments \"<a href='https://www.informationliberation.com/?id=65007'>that intermarriage rates [among Jews] continue to go up. Assimilation continues apace.</a>\"<br><br>Aimenn is currently held at Federal Corrections Institution McDowell in McDowell County, WV on the border of Northern Virginia. The dual-facility sits atop a <a href='https://archive.ph/20130629094212/http://www.wvpubcast.org/newsarticle.aspx?id=15583'>decapitated mountain</a> that was long ago exploited for its coal.<br><br>The area's 18,400 plus population is estimated to be around 87% White with a median income 25% lower than the national average. The average resident is around 13% older than the average American.<br><br>The presence of these troubling statistics continue to fly in the face of what was the <a href='https://web.archive.org/web/20160409201618/https://www.highbeam.com/doc/1P2-13854697.html'>original understanding</a> with McDowell's residents in 2004: the feds build a prison, and you get a decent job.<br><br>5 years after the first construction, the prison began accepting job applications. Some time after it's opening in 2010, reports from local news showed that <a href='https://archive.ph/20130629094212/http://www.wvpubcast.org/newsarticle.aspx?id=15583'>less than 14%</a> of the facility's first hiring batch were from McDowell County.<br><br>The fact that the local news organizations tracking this story have since shut down further suggests that FCI McDowell did little to rescue a formerly prosperous county, once known as America's leading coal producer.<br><br>Aimenn is a Wotanist, which is a follower of Germanic Paganism. His daily activities include working out, watching the news, and reading before bed. On most days, Aimenn checks his email where he can be <a href='mailto:nobody@email.com'>contacted directly</a> or <i>via</i> our <a href='emailproxy.html'>free proxy service</a>.<br><br>You can read a Substack post written by Aimenn <a href='https://jiblog.substack.com/p/a-little-about-myself'>here</a>.",
  "profile_link": "#",
  "image_url": "https://solidarityexchange.github.io/SE/pictures/PENNY_AIMENN.PNG",
  "state": "WV",
  "mailing_address": "AIMENN PENNY, 51942-510<br>FCI McDowell<br>FEDERAL CORRECTIONAL INSTITUTION<br>P.O. BOX 1009<br>WELCH, WV 24801"
},
  {
    "id": "14",
    "name": "Sarah Clendaniel",
    "bio": "Sarah Clendaniel is currently serving 18-years in federal prison after she pled guilty to charges related to an FBI-involved scheme to attack the Baltimore power grid.<br><br>The prosecution claimed that Sarah and her co-defendant, Brandon Russell, would have done a whopping $75 million in damage to various power stations using only <a href='https://archive.ph/1YrDV'>guns and mylar balloons.</a><br><br>Her scheduled release data is June 5, 2038.<br><br>Clendaniel’s <a href='https://storage.courtlistener.com/recap/gov.uscourts.mdd.530115/gov.uscourts.mdd.530115.93.0_3.pdf'>plea agreement</a> contains quotes indicating her mental state was compromised and that she was behaving recklessly:<br><br>\"Clendaniel asked [Confidential Human Source 1] to purchase a rifle for her, stating that she wanted to ‘accomplish something worthwhile’ before her death.\"<br><br>The document also reiterates Clendaniel’s kidney failure; an eventually fatal condition. This tactic of targeting the sick or dying was also used in the <a href='https://solidarityexchange.github.io/SE/dynamicbio.html?id=05'>Jacob Robards</a> case.<br><br>Like other targets of the FBI’s anti-White stings, Clendaniel was also compromised by past drug use and a record of prior convictions.<br><br>An FBI collaborator was instrumental to the conspiracy, another common theme to FBI stings. One of several confidential informants was to deliver both the weapons and Sarah herself to the alleged attack sites. As Sarah had only recently regained her license, she said that she did not feel comfortable operating a motor vehicle.<br><br>Accused alongside Sarah was <a href='https://solidarityexchange.github.io/SE/dynamicbio.html?id=31'>Brandon Russell</a>, Clendaniel’s <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>reported boyfriend</a>. He pleaded not guilty to all charges but was eventually convicted and was sentenced in August of 2025 to <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>20 years in prison</a>. Brandon is expected to appeal.<br><br>One month after Russell’s conviction, a confidential informant for the prosecution revealed he had been paid <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>$7,000 the week of jury selection</a> for Brandon. The same witness received $70,000 in total for similar ‘services’ rendered to the FBI but had allegedly failed to disclose the most recent payment.<br><br>Nevertheless, <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>Judge James K. Bredar</a> did not think this sufficient to hold a new trial. The same judge had once dismissed a potential juror who claimed to be a racist, saying, \"you're excused. <a href='https://www.wbaltv.com/article/brandon-russell-trial-jury-plot-destroy-baltimore-power-grid/63574539'>We don't tolerate racist views in the justice system.\"</a><br><br>During Brandon and Sarah’s legal proceedings, FBI Director Wray made a speech where he said that the FBI used a  warrantless <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>Foreign Intelligence Surveillance Act</a> (or FISA) wiretap to disrupt a planned attack on a power grid that same year.<br><br>The defense suggested that Wray was referencing Brandon and Sarah’s case and thus, the FBI had violated their rights. The prosecution dismissed this as speculative.<br><br>Despite the <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>unexpected intervention</a> of the ACLU on Russell’s behalf, the government kept their secrets. In a private session with the prosecution, antiracist Judge Bredar agreed that both Russell’s and Clendaniel’s rights were protected, claiming that the government did not use evidence from a FISA wiretap.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/CLENDANIEL_SARAH.PNG",
    "state": "FL",
    "mailing_address": "SARAH BETH CLENDANIEL, #42941-510\nFCI Tallahassee\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 5000\nTALLAHASSEE, FL   32314",
    "wishlists": [
      {
        "retailer": "Amazon",
        "url": "https://www.amazon.com/hz/wishlist/example-sarah1"
      },
      {
        "retailer": "Walmart",
        "url": "https://www.walmart.com/registry/example-sarah2"
      },
      {
        "retailer": "Barnes & Noble",
        "url": "https://www.barnesandnoble.com/account/wishlist/example-sarah3"
      }
    ]
  },
  {
    "id": "15",
    "name": "Stephen Pattison",
    "bio": "Stephen is currently serving a <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>9-year federal prison sentence</a> after being convicted of possession of a firearm and ammunition by a convicted felon.<br><br>He is scheduled for release on August 23, 2028.<br><br>Stephen is presently located at the United States Penitentiary, Florence High in central Colorado. The prison shares a campus with the notorious ADX Florence, a facility known as the \"Alcatraz of the Rockies.\"<br><br>Despite his somewhat moderate charges, Stephen finds himself among some of America's most notorious convicted terrorists, including several who are linked to Al-Qaeda.<br><br>According to a <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>criminal complaint</a> filed by the anti-White FBI agent, Adam Paradowski, the local Joint Terrorism Task Force became aware of Stephen when he counter-protested Black Lives Matter. At both of the protests in September 2020, Paradowski noted that Pattison was merely near people that were engaged in arguments or confrontations. Some of which included threats.<br><br>According to Paradowski, police happened upon Stephen during an <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>Upstate New York traffic stop</a>, realizing that Stephen had a warrant out for his arrest for absconding parole in Missouri. Stephen tells <i>SE</i> that this leaves out many crucial details, including the fact that the same government that filed this warrant never pursued a conviction. Stephen further explained that he was not absconding parole, he was living openly with his family and had been transferred to the supervision of New York State.<br><br>While the police closed in on Stephen, antifascist criminals were threatening his entire family, including his children.<br><br>During Stephen's <a href='https://www.courtlistener.com/docket/60875972/united-states-v-pattison/'>sentencing phase</a>, his own attorney referred to his views as \"repugnant to most Americans,\" and called him a \"neo-Nazi.\" The unoriginal Judge Larimer would suggest to Stephen that he use his time in prison to get an education and to read the anti-racist Black poet, Maya Angelou.<br><br>Today, Stephen remains dedicated to his race, which includes several children of his own. He prefers to spend his days at Florence socializing with his white friends or in long debates about race and history with inmates of other backgrounds. When finances allows, he calls family and friends.<br><br>Stephen always welcomes letters from his comrades.",
    "profile_link": "#",
    "image_url": "pictures/PATTISON_STEPHEN3.png",
    "state": "CO",
    "mailing_address": "STEPHEN REED PATTISON 19944-509\nUSP FLORENCE - HIGH\nU.S. PENITENTIARY\nP.O. BOX 7000\nFLORENCE, CO 81226",
    "wishlists": [
      {
        "retailer": "Amazon",
        "url": "https://www.amazon.com/hz/wishlist/example-generic"
      }
    ]
  },
  {
    "id": "16",
    "name": "Joshua Michael Steever",
    "bio": "Joshua Steever, founder of the US chapter of the Aryan Strikeforce, is serving a <a href='https://www.pennlive.com/crime/2020/07/founder-of-a-white-nationalist-group-sentenced-to-20-years-in-drugs-guns-case.html'>20-year sentence</a> after becoming the main target of an FBI operation that manufactured a drugs-for-guns conspiracy from start to finish.<br><br><a href='https://www.pennlive.com/crime/2020/07/founder-of-a-white-nationalist-group-sentenced-to-20-years-in-drugs-guns-case.html'><i>PennLive</i></a> reports that federal agents orchestrated all aspects of the alleged \"drugs-for-guns\" plot, using fake methamphetamine and staging sales for gift cards allegedly meant to buy weapons.<br><br>Joshua ultimately <a href='https://www.pennlive.com/crime/2020/07/founder-of-a-white-nationalist-group-sentenced-to-20-years-in-drugs-guns-case.html'>pleaded guilty</a> to conspiracy to distribute controlled substances despite no real meth being involved.<br><br>As <i>National Justice</i> notes, there was no existing conspiracy until FBI undercover employees infiltrated the group, supplied the drugs, posed as buyers, and drove the entire plan. Several defendants, including a cancer-stricken, homeless co-defendant, <a href='https://www.adl.org/resources/article/racist-skinhead-crew-aryan-strikeforce-88-stands-8-arrests-8-months'>Jacob Robards</a>, were drawn into the operation while facing desperate circumstances.<br><br>Joshua is being held at a medium-security Federal Corrections Institution in Otisville, NY. Due to the close proximity to New York City and its friendliness to Orthodox Jewish rituals, it has been referred to as \"Jewish jail.\" In 2008, <a href='https://nymag.com/news/intelligencer/46010/'>Jews</a> were estimated to be around 5%-10% of the prison's population, with no wildly publicized update since.<br><br>FCI Otisville was the home of the infamous Jewish fraudster, <a href='https://www.justice.gov/pardon/page/file/1358301/dl?inline'>Sholam Weiss</a> until 2021. Weiss was serving out a sentence of around 835 years when he received a pardon from President Donald Trump in 2021.<br><br><b>On any given day, Joshua is typically working out or reading. He also enjoys playing chess, and speaking with like-minded inmates. Joshua always welcomes money in his commissary fund and also enjoys receiving letters from comrades.<br><br>Joshua has included a wishlist if you are able to contribute money for books and other helpful items.</b>",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/STEEVER_JOSHUA.PNG",
    "state": "NY",
    "mailing_address": "Joshua Michael Steever #75745-067\nFCI Otisville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 1000\nOTISVILLE, NY   10963",
    "wishlists": [
      {
        "retailer": "Amazon",
        "url": "https://www.amazon.com/hz/wishlist/example-generic"
      }
    ]
},
  {
  "id": "22",
  "name": "George D. Loeb Jr",
  "bio": "George David Loeb Junior was born 3 February 1957 in Teaneck, New Jersey. Raised in North Miami, Florida, George graduated from North Miami High School (class of 1975), and earned an Associate of Arts, with honors from Miami-Dade Community College in 1977.<br><br>Loeb was employed in restaurants, retail management and in the automotive parts and service field. Later, returning to school, Loeb attended the University of Colorado, while living in Boulder from 1981-85. There he met and married Barbara &quot;Barb&quot; Krueger, who Loeb describes, to this day, as &quot;a saintly woman&quot;.<br><br>The Loebs later moved to Jacksonville, Florida where he graduated from the University of North Florida (Bachelor of Business Administration 1985). While in Jacksonville, Loeb made powerful enemies, first as the co-founder of Citizens For A Better Florida, Inc., inventors of a unique and aggressive anti-telemarketing no-call list. Loeb also angered corrupt politicians and big business interests as an open forum speaker and writer of numerous &quot;letters to the editor&quot; published primarily by the major daily newspaper, The Florida Times-Union.<br><br>Loeb was also a member and reverend in the highly controversial Otto, North Carolina-based White racial organization, then known as Church Of The Creator. Among his accomplishments there, Loeb arranged for COTC Founder Ben Klassen&apos;s only nationally televised TV interview.<br><br><strong>17 May 1991<br>Neptune Beach, Florida</strong><br><br>George Loeb and his wife Barb, were entering a grocery store parking lot when there was a near collision between the car driven by Mr. Loeb and a car driven by troubled black US Navy Sailor, Harold Mansfield. Mansfield &quot;blew his horn in anger&quot; and began wildly cursing, calling Loeb a &quot;cracker&quot; and a &quot;redneck&quot;. Mr. Loeb drove on, into the parking lot. Mansfield&apos;s car was seen driving away on Atlantic Blvd. It is undisputed Mansfield returned to the scene almost 30 minutes later with a brick and an accomplice, fellow black US Navy Sailor Stephen Rutledge.<br><br>Just as the Loeb&apos;s entered their car to leave, Mansfield&apos;s car came to a screeching stop alongside. Mansfield got out armed with the brick saying he was going to &quot;smash [his] motherf***ing head in.&quot;<br><br>Loeb fired a single shot killing Mansfield. Witnesses said Loeb fired several other shots &apos;high in the air&apos;, forcing Rutledge to retreat. Though an obvious case of road rage on the part of the decedent, Mansfield, the court allowed Loeb&apos;s racial view to become the focus at trial. George Loeb was convicted of premeditated murder and sentenced to life with 25 years minimum mandatory. Even though some appeals may still be possible Mr. Loeb, a political prisoner, has been unable to find any competent attorney willing to take his case.<br><br>Barb Loeb filed for, and was granted, a divorce in 1996.<br><br>George Loeb is currently incarcerated at the Columbia Correctional Institution in Lake City, Florida.",
  "profile_link": "#",
  "image_url": "https://solidarityexchange.github.io/SE/pictures/LOEB_GEORGE.PNG",
  "state": "FL",
  "mailing_address": "Loeb, George D JR., DC# 292124\nPO Box 23608\nTampa, FL 33623",
  "facility_url": "http://www.dc.state.fl.us/offenderSearch/detail.aspx?Page=Detail&DCNumber=292124&TypeSearch=AI"
},  
  {
    "id": "31",
    "name": "Brandon Clint Russell",
    "bio": "Brandon Russell is currently incarcerated—most recently in Maryland State Prison—after being <a href='https://www.courtlistener.com/docket/66811663/united-states-v-clendaniel/'>convicted of conspiracy</a> to damage an energy facility in an FBI-involved scheme.<br><br>In <a href='https://www.cbsnews.com/baltimore/news/neo-nazi-maryland-power-grid-sentenced-brandon-russell/'>August of 2025</a>, Brandon was sentenced to the allowed maximum of 20 years in prison. He reportedly plans to appeal.<br><br>The prosecution claimed that Brandon and his co-defendant, reported girlfriend Sarah Clendaniel, would have done a whopping $75 million in damage to various power stations using only <a href='https://archive.ph/1YrDV'>guns and mylar balloons.</a><br><br>Sarah, who pleaded guilty and received an 18-year sentence for her alleged role in the plot, was dying of kidney failure at the time of the sting.<br><br>Brandon would attempt to identify the government's confidential informants but his legal motions were defeated and he was convicted in February of 2025.<br><br>One of the anonymous witnesses would reveal that he had been paid $70,000 by the FBI during his four years as a per diem professional informant. One month after Russell was convicted, the government revealed the same witness had been paid an additional $7,000 that he failed to disclose. This payment was sent the week of jury selection.<br><br>Nevertheless, <a href='https://www.baltimoresun.com/2025/05/05/no-new-trial-for-white-supremacist-baltimore-grid/'>Judge James K. Bredar</a> did not think this sufficient to hold a new trial. The same judge had once dismissed a potential juror who claimed to be a racist, saying, &quot;you're excused. <a href='https://www.wbaltv.com/article/brandon-russell-trial-jury-plot-destroy-baltimore-power-grid/63574539'>We don't tolerate racist views in the justice system</a>.&quot;<br><br>During Brandon and Sarah’s legal proceedings, FBI Director Wray made a public speech where he said that the FBI used a warrantless <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>Foreign Intelligence Surveillance Act</a> (or FISA) wiretap to disrupt a planned attack on the power grid that same year.<br><br>The defense suggested that Wray was referencing Brandon and Sarah’s case and thus, violated their rights. The prosecution dismissed this as speculative, refusing to confirm or deny the implication.<br><br>Despite the <a href='https://www.thebaltimorebanner.com/community/criminal-justice/brandon-russell-neo-nazi-fisa-evidence-XG2FGX6RCNEY3BPKPHQ4O27SAA/'>unexpected intervention</a> of the ACLU on Russell’s behalf, the government kept their secrets. In a private session with the prosecution, antiracist Judge Bredar agreed that Russell’s rights were protected and that the government did not use evidence from a FISA wiretap.<br><br>Brandon is a veteran of the <a href='https://www.tribune242.com/news/2018/jan/12/bahamian-neo-nazi-jailed-for-five-years-in/'>Florida National Guard</a> and has an undergraduate degree in Nuclear Physics. He is a dual citizen of both the United States and the Bahamas. During his current stay in a Maryland state prison, Russell began his own newsletter titled simply, <i>White Prison Newsletter</i>.",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/RUSSELL_BRANDON.jpg",
    "state": "MD",
    "mailing_address": "Brandon Clint Russell, SID # 5348309\nChesapeake Detention Facility\n401 East Madison Street\nBaltimore, Maryland 21202",
    "facility_url": "https://www.dpscs.state.md.us/inmate/",
    "wishlists": [
      {
        "retailer": "Amazon",
        "url": "https://www.amazon.com/hz/wishlist/example-generic"
      }
    ]
  },
  {
    "id": "35",
    "name": "Nicholas Welker",
    "bio": "Whistleblower detained for <a href='https://www.google.com'>leaking</a> classified <a href='https://www.google.com'>documents.</a>",
    "profile_link": "#",
    "image_url": "https://solidarityexchange.github.io/SE/pictures/BLANK.png",
    "state": "SC",
    "mailing_address": "NOT REAL \nFCI Bennettsville\nFEDERAL CORRECTIONAL INSTITUTION\nP.O. BOX 52020\nBENNETTSVILLE, SC   29512",
    "wishlists": [
      {
        "retailer": "Amazon",
        "url": "https://www.amazon.com/hz/wishlist/example-generic"
      }
    ]
  }
]
